# CODE 7-10

In [2]:
import pandas as pd 

df1 = pd.DataFrame([[169, 58, 1.0], [172, 73, 1.2], [184, 82, 0.7]], columns=['height', 'weight', 'eye'])

df2 = pd.DataFrame([[176, 71, 0.8], [169, 62, 0.7, 'F'], [158, 60, 1.3, 'M']], columns=['height', 'weight', 'eye', 'gender'])

df3 = pd.DataFrame([[3,22], [2,21]], columns=['grade', 'age'])

df1

   height  weight  eye
0     169      58  1.0
1     172      73  1.2
2     184      82  0.7

In [4]:
df2

   height  weight  eye gender
0     176      71  0.8   None
1     169      62  0.7      F
2     158      60  1.3      M

In [6]:
df3

   grade  age
0      3   22
1      2   21

In [8]:
df12 = pd.concat([df1, df2])
df12

   height  weight  eye gender
0     169      58  1.0    NaN
1     172      73  1.2    NaN
2     184      82  0.7    NaN
0     176      71  0.8   None
1     169      62  0.7      F
2     158      60  1.3      M

In [10]:
df12 = df12.reset_index()
df12

   level_0  index  height  weight  eye gender
0        0      0     169      58  1.0    NaN
1        1      1     172      73  1.2    NaN
2        2      2     184      82  0.7    NaN
3        3      0     176      71  0.8   None
4        4      1     169      62  0.7      F
5        5      2     158      60  1.3      M

In [ ]:
# not column-wise
df13 = pd.concat([df1, df3], axis = 0) # row-wise
df13

   height  weight  eye  grade   age
0   169.0    58.0  1.0    NaN   NaN
1   172.0    73.0  1.2    NaN   NaN
2   184.0    82.0  0.7    NaN   NaN
0     NaN     NaN  NaN    3.0  22.0
1     NaN     NaN  NaN    2.0  21.0

In [ ]:

df13 = pd.concat([df1, df3], axis = 1)
df13

   height  weight  eye  grade   age
0     169      58  1.0    3.0  22.0
1     172      73  1.2    2.0  21.0
2     184      82  0.7    NaN   NaN